---
kind: enumMember
id: F:Autodesk.Revit.DB.FillPatternHostOrientation.AsText
enum: Autodesk.Revit.DB.FillPatternHostOrientation
source: html/77580679-4563-f4f8-0253-af7215d4dea6.htm
---
# Autodesk.Revit.DB.FillPatternHostOrientation.AsText

Mimics the behavior of text. Patterns align with the host and share the same origin with respect to view.